setAnalysisMode -analysisType single -checkType setup -clkSrcPath true -clockPropagation sdcControl -skew true -virtualIPO false
setTrialRouteMode -handlePreroute true -keepMarkedOptRoutes true
setOptMode -congOpt false -drcMargin 0 -effort high -fixDrc true -holdTargetSlack 0 -maxDensity 0.95 -maxLocalDensity 0.98 -route noPreserve -rPlace true -setupTargetSlack 0 -simplifyNetlist false -yieldEffort none
setExtractRCMode  -engine default -assumeMetFill 1
setDelayCalMode -engine default
setPlaceMode -congEffort medium -ignoreScan true -incrPlaceForOpt true -timingDriven true -useNP true -WLHighEffort false
setIlmMode -highFanoutPort true -loopBack false 
