#***************************************************
# Timing constraint file in PT format
#
# - Note: This is all case-sensitive
#***************************************************

#***************************************************
# Clock Constraints	
#***************************************************
create_clock  -period 708.0000000 -waveform { 0.0000000 354.0000000}\
   [get_ports {clk}]


#***************************************************
# Input Pin Constraints
#***************************************************	 
set_input_delay -clock clk 1.0000 \
   [get_ports {n_rst}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {ws_in}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_vol[3]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_vol[2]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_vol[1]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_vol[0]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_com[3]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_com[2]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_com[1]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_com[0]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_clp[3]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_clp[2]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_clp[1]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {pot_amp_clp[0]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {swch_mode_en[3]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {swch_mode_en[2]}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {swch_mode_en[1]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {swch_mode_en[0]}]
set_input_delay -clock clk 1.0000 \
   [get_ports {mem_clr}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {serial_data_in}] 

#***************************************************
# Output Pin Constraints
#***************************************************
set_output_delay -clock clk 1.0000 \
   [get_ports {serial_data_out}] 
set_output_delay -clock clk 1.0000 \
   [get_ports {ws_out}] 
set_output_delay -clock clk 1.0000 \
   [get_ports {sck}] 

#***************************************************
# Pin Driving Cells (Needed only for Inputs)
#***************************************************
set_driving_cell -lib_cell INVX8\
   [get_ports {clk}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {n_rst}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {ws_in}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_vol[3]}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_vol[2]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_vol[1]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_vol[0]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_com[3]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_com[2]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_com[1]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_com[0]}]	 
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_clp[3]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_clp[2]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_clp[1]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {pot_amp_clp[0]}]	 
set_driving_cell -lib_cell INVX8\
   [get_ports {swch_mode_en[3]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {swch_mode_en[2]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {swch_mode_en[1]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {swch_mode_en[0]}]
set_driving_cell -lib_cell INVX8\
   [get_ports {mem_clr}]
set_driving_cell -lib_cell INVX8\
   [get_ports {serial_data_in}]
